Animation.create!(
  [
    {
      animation_name: 'ONE PIECE ワンピース',
      animation_image: File.open('./app/assets/images/onepiece.jpeg'),
      synopsis: 'かつてこの世の全てを手に入れた伝説の海賊王ゴールド・ロジャーが遺した、「ひとつなぎの大秘宝（ワンピース）」をめぐり、幾人もの海賊が覇権を賭けて争う大海賊時代。そんな時代に生まれ、幼い頃の命の恩人である海賊赤髪のシャンクスに憧れる少年モンキー・D・ルフィは、「ゴムゴムの実」と呼ばれる不思議な実（「悪魔の実」の一種）を食べてゴム人間となり、泳げない体になりながらも海賊王を目指して仲間と共に冒険する。'
    },
    {
      animation_name: 'ドラゴンボール',
      animation_image: File.open('./app/assets/images/dragonball.jpg'),
      synopsis: '山奥で１人くらしていた少年、孫悟空の前に突然ブルマという女の子が現れた。ブルマは７個揃えると願いがかなうというドラゴンボールを求めてやってきたのだ。悟空のじいちゃんが遺した珠がまさにそのドラゴンボールであったことから二人の不思議な旅が始まった。'
    },
    {
      animation_name: 'ドラゴンボールZ',
      animation_image: File.open('./app/assets/images/dragonball_z.jpg'),
      synopsis: '天下一武道会の壮絶な闘いから５年…。世界は、極上の平和を手に入れ、孫悟空も最愛の妻・チチとの間に息子・悟飯が誕生し、平穏な日々を過ごしていた。しかし、ある日突然、強靭な尻尾を持つ謎の男・ラディッツの出現によって、平和はもろくも崩れ去りる。その想像を絶するパワーは、悟空や弟弟子のクリリンさえも一撃で倒してしまう程強力。このラディッツこそ、惑星ベジータが巨大流星の衝突によって全滅した時、奇跡的に生き残った悟空の兄だったのだ。ラディッツは卑怯にも悟飯を人質に取り、自分たち兄弟の仲間に加わることを悟空に強制した。兄たちの狙いは、地球に住む人々を絶滅させて、地球を我がものとすること。悟空には、そんな兄たちの野望に手を貸すことなど出来る筈がない。一大危機に見舞われた悟空は、宿命のライバル・ピッコロ大魔王と手を組み、兄ラディッツに戦いを挑むが・・。'
    },
    {
      animation_name: 'ドラゴンボールGT',
      animation_image: File.open('./app/assets/images/dragonball_gt.jpg'),
      synopsis: '悟空がウーブと修行の旅に出てから5年。悟空の教えを受け15歳になったウーブは、立派な戦士になっていた。修行の最終試験を行っている頃、願いを叶えてから一年以内に揃えないと星そのものが消滅し人類滅亡となってしまうという究極のドラゴンボールを、世界征服を企むピラフが使ってしまう（しかも、そのときの願いを神龍が勘違いしたことにより、悟空は子供の姿にされてしまう）。悟空は、パンとトランクスと共に、ドラゴンボールを集めるため宇宙へと旅立つ。'
    },
    {
      animation_name: 'NARUTO ナルト',
      animation_image: File.open('./app/assets/images/naruto.jpeg'),
      synopsis: '忍者を目指しアカデミーに通う主人公うずまきナルトは、忍者アカデミーの超問題児で毎日イタズラ三昧。落ちこぼれで、3回卒業試験に落第していたが、自分の身を呈して守ってくれた教師うみのイルカの行動をきっかけとして目覚め、何とか下忍になる。下忍になったナルトは、うちはサスケ、春野サクラと共に、上忍はたけカカシの班に配属される。カカシから鈴を奪い取るサバイバル演習では自分たちの未熟さを思い知るが、“仲間の大切さ”に気付き、これまで合格者を出したことのないカカシから正式に下忍として認められ、以後一人前の忍者となるべく様々な任務をこなして成長していく。'
    },
    {
      animation_name: 'BORUTO ボルト',
      animation_image: File.open('./app/assets/images/boruto.jpg'),
      synopsis: '長きに渡る戦争を経て高度成長を遂げた新時代。七代目火影・うずまきナルトが統治する木ノ葉隠れの里を中心に、新たな忍を育てる「中忍選抜試験」が5つの里合同で開催されようとしていた。里の手練場で修業に明け暮れる三人一組の下忍たち。サスケの娘にしてナルトに憧れを抱くサラダ、多くの謎を持つ超優秀な忍ミツキ、そして才能を持ちながらもナルトをクソオヤジ呼ばわりするボルト。ボルトは、多忙が故に家族と過ごす時間すらないナルトを「親なんて初めからいない方がいい」と寂しさゆえに忌み嫌うようになってしまっていたのだ。ある夜、異空間での任務にあたっていたサスケが、妙な危険が迫っている事を知らせにナルトの元に訪れる。互いの子世代の忍の事を話すナルトとサスケ。そんな中、サスケの事を「ナルト唯一のライバル」とサラダから聞き憧れていたボルトは、父親の弱点を知ろうと弟子入りを願う。友の状況を悟ったサスケは"ある条件"付きで師匠となることを約束。ボルトはナルトに実力を見せつけるために、サラダ、ミツキと共に中忍選抜試験への出願を決めた。知能勝負の一次試験、チームワーク勝負の二次試験と難関を突破していくボルトたち。三次試験の個人戦コロシアムでは、各里の長である五影が見守る中、ついにシカマルの息子であるシカダイとも激突!その時、空間が捻じ曲がるほどの大爆発が!禍々しい雰囲気を纏い現れたモモシキとキンシキと名乗る二人組は、両手に宿した輪廻眼を操りナルトの命を執拗に狙う。何もできず立ちすくむボルトを護るサスケ。それを背に立ち塞がったナルトは、モモシキが放った術と共に消えてしまった。ボルトへ微笑みを残して―。父親が歩んできた道、そしてその想いを初めて知ったボルト。その小さな姿にかつてのナルトを見たサスケ、そして五影とともに ボルトは敵うハズのない敵が待つ異空間へ、決死の覚悟で挑む!'
    },
    {
      animation_name: 'トリコ',
      animation_image: File.open('./app/assets/images/toriko.jpg'),
      synopsis: '「食」をテーマとした異色のバトル漫画。美食が世界的流行となっている「グルメ時代」。世界中に未知の食材が溢れ、1つの食材に億単位の大金が動くことも珍しくない。そんなグルメ時代の中、未開の味を探求する「美食屋」トリコが、様々な食材を求めて世界中を冒険する。狙いの多くは猛獣や秘境にのみ存在するため捕獲が困難でありそれらを巡って激しい闘いが行われる。'
    },
    {
      animation_name: 'BLEACH ブリーチ',
      animation_image: File.open('./app/assets/images/BLEACH.jpg'),
      synopsis: '黒崎一護は霊が見える以外は普通の高校生であった。死神朽木ルキアと出会うまでは…。最初は死神の存在を信じなかった一護だが、人の魂を喰らう化け物、虚（ホロウ）が襲ってくる。家族を助けるために虚に立ち向かう一護。絶望的状況の中、一護はルキアから死神の力を貰い、死神となって虚（ホロウ）を撃退した。しかし、彼に死神としてのほとんどの力を奪われ、弱体化したルキア。そこでルキアは自身の力が戻るまで一護に死神代行を務める様迫る。一度は断る一護だが、「俺の同類を作りたくない」、家族を救われたなどの理由で死神代行を引き受ける。'
    },
    {
      animation_name: 'ジョジョの奇妙な冒険',
      animation_image: File.open('./app/assets/images/jojo.jpg'),
      synopsis: '古代メキシコで繁栄を遂げた太陽の民アステカ。彼らには奇妙な 「石仮面」が伝わっていた。それは、永遠の命と真の支配者の力をもたらすという奇跡の仮面。だが、ある時を境に歴史から姿を消すこととなる。やがて時は過ぎ、19世紀後半。人々の思想と生活が激変していた時代に出会った、ジョナサン・ジョースターと ディオ・ブランドー。2人は少年時代から青年時代を共に過ごし、やがて「石仮面」を巡って数奇な運命を辿ることとなる――。'
    },
    {
      animation_name: 'ジョジョの奇妙な冒険 黄金の風',
      animation_image: File.open('./app/assets/images/jojo_gold.jpg'),
      synopsis: 'イタリア、ネアポリスに住む青年ジョルノ・ジョバァーナは、ジョースター家の宿敵・DIOの血を継ぐ息子である。幼少時代に迫害を受けて荒んでいた彼は、一人のギャングの男を救った事をきっかけに、「人を信じる」ことを学ぶ。奇妙なことに、恩義を忘れず、敬意を持って自分に接するギャングが、彼の心をまっすぐにしたのだ。そうして、ジョルノは「ギャング・スター」にあこがれるようになった。15歳になったジョルノは、イタリアの裏社会を牛耳るギャング組織「パッショーネ」とトラブルを起こし、狙われることとなり…'
    },
    {
      animation_name: 'ジョジョの奇妙な冒険 ダイヤモンドは砕けない',
      animation_image: File.open('./app/assets/images/jojo_diamond.jpg'),
      synopsis: 'エジプトでの宿敵DIOとの死闘から11年後。1999年、空条承太郎は祖父ジョセフ・ジョースターの隠し子、東方仗助に会うため、日本のM県S市、杜王町にやってきた。しかし発見した仗助は承太郎と同じ特殊能力、「スタンド」を持っていた。そして、承太郎の来訪を皮切りにまるで引かれ合うように、新たな「スタンド使い」達が動き始める。「この町には何かがある…」生まれ育った杜王町を守るため、仗助は立ちあがる――'
    },
    {
      animation_name: 'ジョジョの奇妙な冒険 スターダストクルセイダース',
      animation_image: File.open('./app/assets/images/jojo_star.jpg'),
      synopsis: '舞台は1987年の日本。100年の時を経て、ジョナサンの肉体を乗っ取ったDIO（ディオ）が復活した。それと共鳴するかのようにジョセフの孫の空条承太郎に、幽波紋（スタンド）という能力が発現する。DIOの影響によって危篤に陥った母の空条ホリィを救うため、承太郎はジョセフらと共にDIOの潜むエジプトを目指す。'
    },
    {
      animation_name: 'ジョジョの奇妙な冒険 スターンオーシャン',
      animation_image: File.open('./app/assets/images/jojo_stone.jpg'),
      synopsis: '西暦2011年、アメリカ・フロリダ州。恋人とのドライブ中、交通事故に遭遇した空条徐倫は、罠に嵌められて15年の刑期を宣告される。収容されたのは、州立グリーン・ドルフィン・ストリート重警備刑務所――別名「水族館」。絶望の淵に立つ徐倫だったが、父から託されたペンダントを手にした時、彼女の中で不思議な力が目覚める。“この世には死ぬより恐ろしい事があって、それがこの刑務所で起こっているのは確実なんだ”徐倫の前に現れた謎の少年からのメッセージ。次々と起こる不可解な出来事。面会に訪れた父・空条承太郎から語られた恐るべき真実、そしてDIOという名前…。果たして空条徐倫は、この刑務所という「石作りの海」から自由になることができるのか？そして、100年以上に及ぶジョースター家とDIOの因縁に終止符を打つ、最後の戦いが始まる!!'
    },
    {
      animation_name: 'となりのトトロ',
      animation_image: File.open('./app/assets/images/totoro.jpg'),
      synopsis: '小学3年生のサツキと5歳になるメイは、お父さんと一緒に都会から田舎の一軒屋にと引っ越してきた。それは退院が近い入院中のお母さんを、空気のきれいな家で迎えるためだった。近くの農家の少年カンタに「オバケ屋敷!」と脅かされたが、事実、その家で最初に二人を迎えたのは、“ススワタリ"というオバケだった。ある日、メイは庭で2匹の不思議な生き物に出会った。それはトトロというオバケで、メイが後をつけると森の奥では、さらに大きなトトロが眠っていた。そして、メイは大喜びで、サツキとお父さんにトトロと会ったことを話して聞かせるのだった。'
    },
    {
      animation_name: '風の谷のナウシカ',
      animation_image: File.open('./app/assets/images/nausika.jpg'),
      synopsis: '極限まで発達した人類文明が「火の七日間」と呼ばれる最終戦争を引き起こし、瘴気（有毒ガス）が充満する「腐海」と呼ばれる菌類の森や獰猛な蟲（むし）が発生した。それから千年余り、拡大を続ける腐海に脅かされながら、わずかに残った人類は、古の文明の遺物を発掘して利用しつつ、細々と生きていた。腐海のほとりにある辺境の小国「風の谷」は、大国トルメキアの戦乱に巻き込まれる。風の谷の族長ジルの娘であるナウシカは、運命に翻弄されながらさまざまな人々と出会い、自分自身と世界の運命、太古より繰り返されて来た人の営みに向き合い、大国と小国、そして腐海と人類との共生の道を探っていく。'
    },
    {
      animation_name: '風立ちぬ',
      animation_image: File.open('./app/assets/images/kazetatinu.jpg'),
      synopsis: 'かつて、日本で戦争があった。大正から昭和へ、１９２０年代の日本は、不景気と貧乏、病気、そして大震災と、まことに生きるのに辛い時代だった。そして、日本は戦争へ突入していった。当時の若者たちは、そんな時代をどう生きたのか？イタリアのカプローニへの時空を超えた尊敬と友情、後に神話と化した零戦の誕生、薄幸の少女菜穂子との出会いと別れ。この映画は、実在の人物、堀越二郎の半生を描く──。堀越二郎と堀辰雄に敬意を込めて。生きねば。'
    },
    {
      animation_name: 'チェンソーマン',
      animation_image: File.open('./app/assets/images/tyenso.jpg'),
      synopsis: '『チェンソーの悪魔』ポチタと共にデビルハンターとして暮らす少年デンジ。親が遺した借金返済のため、ド底辺の日々を送る中、裏切りに遭合い殺されてしまう。薄れる意識の中、デンジはポチタと契約し、悪魔の心臓を持つもの『チェンソーマン』として蘇る──。'
    },
    {
      animation_name: 'モブサイコ100',
      animation_image: File.open('./app/assets/images/mobu.jpg'),
      synopsis: '自己表現がヘタな超能力少年・影山茂夫、通称・モブ。普通の生き方にこだわり、超能力を封印しているモブだが、感情が昂り、その数値が100になったとき、彼の身に何かが起こる!インチキ霊能力者、悪霊、謎の組織……モブを取り巻く様々な人に囲まれて、彼はいったい何を思い、何を選ぶのか?WEBコミック界のカリスマ=ONE(「ワンパンマン」)の原作を、アニメーションスタジオの最高峰=ボンズがテレビアニメ化!TOKYO MX他にてテレビアニメ放送中! 2つのONEによる期待値100%超の青春超能力アクション!'
    },
    {
      animation_name: 'ワンパンマン',
      animation_image: File.open('./app/assets/images/wanpan.jpg'),
      synopsis: '「ワンパンマン」は、強くなりすぎたためにどんな怪人も一撃で倒してしまうヒーロー・サイタマが主人公のアクションもの。'
    },
    {
      animation_name: '機動戦士ガンダム',
      animation_image: File.open('./app/assets/images/gundam.jpg'),
      synopsis: 'スペースコロニーへの宇宙移民開始を紀元とした未来世界、宇宙世紀0079年が舞台。人類は増え続ける人口のため、半数が月軌道周辺にあるラグランジュ点に浮かぶスペースコロニー群（サイドと呼ばれる）に居住していた。その中で地球に最も遠いコロニー群サイド3はジオン公国を名乗り、地球連邦からの独立を求め、人型機動兵器「MS（モビルスーツ）」を駆使して独立戦争を挑んできた。開戦から僅か1ヶ月あまりで双方の陣営は総人口の半分を死に至らしめた。そんな中、サイド7に住む少年アムロ・レイは、地球連邦軍が進めていた「V作戦」に対する調査のためサイド7に侵入したジオン軍MS ザクの攻撃に巻き込まれ偶然が重なり、連邦軍の新型MS ガンダムのパイロットになってしまう。'
    },
    {
      animation_name: '機動戦士ガンダムSEED',
      animation_image: File.open('./app/assets/images/gundam_seed.jpg'),
      synopsis: 'コズミック・イラ（C.E.）70年に「血のバレンタイン」の悲劇によって引き起こされた、ナチュラルを代表する地球連合軍（O.M.N.I.Enforcer）とコーディネイターを代表するザフト軍（Z.A.F.T.）の緊張は頂点に達しやがてコーディネイターのみからなるスペースコロニー国家「プラント」は、ナチュラルの国家群からなる国際機関「地球連合」に対し独立を宣言し、戦争が始まる。\n中立国オーブのコロニーヘリオポリスで平和な学生生活を過ごす学生だったキラ・ヤマトは、ザフト軍の襲撃に際し秘密裏に製造されていたモビルスーツストライクガンダムに乗り込み、撃退する。軍の最重要機密に触れたという理由で拘束されるが、その優秀なパイロット能力などから、人員不足のアークエンジェルにおける主戦力として、ストライクのパイロットを務めることになり、激烈な戦火の中に身を投じていくこととなる…。'
    },
    {
      animation_name: '機動戦士ガンダムUC',
      animation_image: File.open('./app/assets/images/gundam_uc.jpg'),
      synopsis: '第二次ネオ・ジオン抗争、別名「シャアの反乱」の終結によって地球圏には束の間の平穏が訪れた。それから3年後、宇宙世紀0096年。工業コロニー「インダストリアル7」において、とある謀議が交わされようとしていた。政財界に絶大な影響力を持ち、地球連邦政府を影から操る ビスト財団が、「袖付き」と通称されるネオ・ジオン残党軍に『それが開かれる時には連邦政府が滅びる』と言われる「ラプラスの箱」を譲渡するという。一方、コロニー内に設置されたアナハイム工専に通う少年バナージ・リンクスは、オードリー・バーンと名乗る謎めいた少女と出会う。新たな戦争の火種となり得る箱の取引を阻止するべく、たった一人で行動を起こした彼女を手助けするうちに、日常に“ずれ”ているような違和感を抱いていたバナージは次第にオードリーに惹かれていく…。'
    },
    {
      animation_name: 'コードギアス 反逆のルルーシュ',
      animation_image: File.open('./app/assets/images/giasu.jpg'),
      synopsis: '皇暦2010年8月10日、世界唯一の超大国神聖ブリタニア帝国は日本と地下資源サクラダイトを巡って対立し宣戦布告、日本に侵攻した。日本は占領され、ブリタニアによって「エリア11」と呼称される。日本人は「イレヴン」と蔑まれ、自由を奪われブリタニアの総督により支配された。ブリタニアは「ナイトメアフレーム」と呼ばれる人型兵器により世界の3分の1を支配下に収めた。しかし、その圧倒的な支配にも亀裂が生まれようとしていた。'
    },
    {
      animation_name: 'STEINS;GATE [シュタインズ・ゲート]',
      animation_image: File.open('./app/assets/images/steins.jpg'),
      synopsis: '舞台は「ニュージェネレーションの狂気」による渋谷崩壊から1年後の秋葉原。秋葉原を拠点とする総勢3人の小さな発明サークル「未来ガジェット研究所」のリーダーで、厨二病から抜け出せない大学生の岡部倫太郎はサークル仲間と日々ヘンテコな発明を繰り返していた。2010年7月28日、岡部は単位取得のため同期にして友人の橋田至と共に向かった講義会場で、弱冠18歳でアメリカの科学誌に学術論文が掲載された天才少女、牧瀬紅莉栖と出会う。しかし、彼はその数時間前にラジオ会館の8階奥で大量の血溜まりの中に倒れる彼女を見ていた。そしてそれを橋田へ報告した携帯メールは、何故かその1週間前の日付で受信されていた。その直後、ラジオ会館ビル屋上に人工衛星らしきものが墜落しており周辺が警察によって封鎖されていたことに気付く。検証の結果、発明品の一つである電話レンジ（仮）が偶然にも携帯メールを過去へと送るタイムマシンとしての機能を備えていたことが判明する。そしてその偶然が全世界の未来を左右する出来事になると、世紀の大発明に浮かれていた「この時の」岡部自身は知る由もなかった……。'
    },
    {
      animation_name: 'それいけ！アンパンマン',
      animation_image: File.open('./app/assets/images/anpanman.jpg'),
      synopsis: 'パン作りの名人、ジャムおじさんが作った最高傑作。それが、アンパンマン。正義の為には、どんな困難も乗り越えて大活躍するかわいいスーパーヒーロー！でも、そんなアンパンマンの事が大嫌いな悪い奴がいる。そいつの名前は、バイキンマン。汚れたものが大好きでバイキンたちの親玉的存在。いつも強気で迫っていくが、大好きなドキンちゃんにだけは頭が上がらない･･･。そんなアンパンマンとバイキンマンのやりとりを、たくさんの愉快な仲間たちと共に展開していくお話。'
    },
    {
      animation_name: 'ゴールデンカムイ',
      animation_image: File.open('./app/assets/images/kamui.jpg'),
      synopsis: '杉元とアシ(リ)パの新たな旅が始まる!! アイヌから奪われた金塊を巡る生存競争サバイバル、新章開幕ッッ!!! 極寒の地・樺太で「不死身の杉元」こと杉元佐一とアイヌの少女・アシ(リ)パが再会を果たした後、キロランケの死に直面したアシ(リ)パが金塊の謎を解く鍵を思い出し、杉元とアシ(リ)パの間で相棒の契約も更新されるに至った。だが、杉元が第七師団の支配下にある状況に変わりはない。アシ(リ)パ確保の報を受けた鶴見中尉との対峙が迫る中、共に過酷な旅を生き抜いた白石由竹、谷垣源次郎、月島軍曹、鯉登少尉は各々の目的や役目に従ってどのように動くのか？　一方、第七師団と金塊の争奪戦を繰り広げる新撰組「鬼の副長」土方歳三の一味は、引き続き残った刺青人皮の捜索を継続。さらに、杉元らの前から姿を消した尾形百之助の存在も情勢に影響を及ぼす可能性を秘める。北の大地を舞台に再び加熱していく一攫千金サバイバルの行方から目が離せない！'
    }
  ]
)
